# St7SetBeamID

Sets the ID number of the specified beam.

long St7SetBeamID(long uID, long BeamNum, long BeamID)

Input Parameters

uID

Strand7 model file ID.

BeamNum

Beam number.

BeamID

Beam ID.